{"config": [{"config": {"input_dtype": "float32", "nb_filter": 24, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "bias": true, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 36, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 48, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 1536, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 1164, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.7, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 1164, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 100, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"p": 0.7, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 100, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 50, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"p": 0.7, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 50, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"p": 0.7, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 10, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 1, "activation": "linear", "b_regularizer": null, "init": "normal", "W_constraint": null, "b_constraint": null, "name": "dense_5"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}