{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 80, 160, 1], "nb_row": 5, "b_constraint": null, "bias": true, "activation": "relu", "nb_filter": 24, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "relu", "nb_filter": 36, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "relu", "nb_filter": 48, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "output_dim": 1164, "input_dim": 1536}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.7}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "output_dim": 100, "input_dim": 1164}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.7}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "name": "dense_3", "output_dim": 50, "input_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.7}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "name": "dense_4", "output_dim": 10, "input_dim": 50}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.7}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "activation": "linear", "init": "normal", "W_constraint": null, "name": "dense_5", "output_dim": 1, "input_dim": 10}}], "keras_version": "1.2.2"}