{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "border_mode": "valid", "input_dtype": "float32", "subsample": [1, 1], "bias": true, "nb_filter": 24, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 36, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 48, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "trainable": true, "activation": "relu", "bias": true, "input_dim": 1536, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.7, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "trainable": true, "activation": "relu", "bias": true, "input_dim": 1164, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.7, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_3", "trainable": true, "activation": "relu", "bias": true, "input_dim": 100, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.7, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_4", "trainable": true, "activation": "relu", "bias": true, "input_dim": 50, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.7, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"output_dim": 1, "init": "normal", "b_regularizer": null, "name": "dense_5", "trainable": true, "activation": "linear", "bias": true, "input_dim": 10, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}]}