{"config": [{"config": {"border_mode": "valid", "input_dtype": "float32", "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 5, "batch_input_shape": [null, 80, 160, 3], "name": "convolution2d_1", "subsample": [1, 1], "bias": true, "nb_col": 5, "nb_filter": 24, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 5, "name": "convolution2d_2", "subsample": [1, 1], "bias": true, "nb_col": 5, "nb_filter": 36, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 5, "name": "convolution2d_3", "subsample": [1, 1], "bias": true, "nb_col": 5, "nb_filter": 48, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "nb_col": 3, "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "name": "convolution2d_5", "subsample": [1, 1], "bias": true, "nb_col": 3, "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dim": 1536, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_1", "output_dim": 1164, "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dim": 1164, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_2", "output_dim": 100, "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_3", "output_dim": 50, "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_4", "output_dim": 10, "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 10, "init": "normal", "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_5", "output_dim": 1, "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}